{
  "id": "24_carrots",
  "title": "24 Carrots",
  "url": "https://cdn.mathgames.com/content/carrot-crave/index.html",
  "description": "24 Carrots is a free math game. Delicious carrots are the life-blood of the world. Some bunnies crave fame, fortune, glory, or worse. But this little bunny, this little bunny wants only one thing: 24 carrots. We here respect and admire this ambition for being both charming and safe.  You see, carrots are both delicious and good for you thus it makes perfect sense then that a bunny would want carrots and not something intangible like being famous. Our hero is the carrot craving bun bun who is determined to see their way through a maze filled with pit traps, rocks, and other hazards in order to chow down on as many delicious carrots as is bunnily possible. In this game, you guide your bunny friend through level after level of confusing and confounding spatial puzzles. You want to conquer the carrots but in order to do so, you'll need to figure out which boulders to push, where to push them, and exactly when they should be pushed. It is a mystery wrapped inside an enigma inside a riddle. It is a puzzle that would confuse even the most prolific thinker. But you're not a thinker, you're a doer and you're doing your friend a favor by getting them those carrots. Push blocks and chow down in this delicious puzzle game.",
  "developer": "Math Games",
  "category": "Brain Teasers & Quizzes",
  "tags": [],
  "controls": "On your desktop or mobile device use your finger to point and pull or your mouse to click and drag the bunny buddy through all these delicious levels.",
  "thumbnailUrl": "/games/assets/24_carrots/thumbnail.jpg",
  "previewUrl": "/games/assets/24_carrots/thumbnail.jpg",
  "previewVideoUrl": "/games/assets/24_carrots/preview.mp4",
  "screenshots": [],
  "features": [],
  "device": {
    "mobile": true,
    "desktop": true
  },
  "addedDate": "Jul 17, 2021",
  "lastUpdated": "2025-03-26",
  "gameUrl": "https://cdn.mathgames.com/content/carrot-crave/index.html"
}